""" Дана целочисленная квадратная матрица В размера nxn.
Найти номер столбцов, все элементы которых - нули """

#  матрица квадратная и равна ( n x n )

massive1 = [1, 3, 0, 4, 0, 6, 7, 8, 9]
massive2 = [1, 0, 2, 4, 0, 6, 7, 8, 9]

"""for element in massive1:
    for element2 in massive2:
        if element == 0 and element2 == 0:
            print('qwe')"""
n = 0
z = 0

